This project will create connection with a database and run a sample of queries on it from Python Pandas.  Am very delighted to relate Python to my vast knowledge of Database.

In [8]:
import sqlite3
import pandas as pd

In [15]:
#This code creates the connection
con=sqlite3.connect("sakila.db")

To run query on a database, it's important to know the schema that indicates the tables with associated attributes, relationships and their cardinalities.  If you want to run data definition language queries or what to insert data into tables, you have to be aware of the existing contraints on the database too.

In [16]:
#The following query should display the schema from the web
#page but in this case because of the huge size, Python
#cannot do it.  So, it is advisable to get it directly from
#the web site.
from IPython.display import Image
Image(url='http://www.dbquanti.eu/css/images/database.png')

In [17]:
#testing out on customer table
sql_query="select * from customer"
df1=pd.read_sql(sql_query,con)
df1.head()

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36.000,2011-09-14 18:10:28
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14 22:04:36.000,2011-09-14 18:10:28
2,3,1,LINDA,WILLIAMS,LINDA.WILLIAMS@sakilacustomer.org,7,1,2006-02-14 22:04:36.000,2011-09-14 18:10:28
3,4,2,BARBARA,JONES,BARBARA.JONES@sakilacustomer.org,8,1,2006-02-14 22:04:36.000,2011-09-14 18:10:28
4,5,1,ELIZABETH,BROWN,ELIZABETH.BROWN@sakilacustomer.org,9,1,2006-02-14 22:04:36.000,2011-09-14 18:10:28

In [18]:
#an function to ease the sending queries to the database
def yem(msql):
    df2=""
    df2 = pd.read_sql(msql,con)
    return df2

In [19]:
#using a join to get from two tables
yem("select first_name,last_name,address from customer c, address a where c.address_id=a.address_id").head()

  first_name last_name            address
0       MARY     SMITH     1913 Hanoi Way
1   PATRICIA   JOHNSON   1121 Loja Avenue
2      LINDA  WILLIAMS  692 Joliet Street
3    BARBARA     JONES   1566 Inegl Manor
4  ELIZABETH     BROWN    53 Idfu Parkway

In [20]:
#an aggregate query that also uses alias
yem("select count(distinct(country_id)) [Number of countries] from city")

   Number of countries
0                  109

In [21]:
#another join with the column names properly rendered
yem("select first_name [First Name],last_name [Last Name],address Address from customer c, address a where c.address_id=a.address_id group by address ").head()

  First Name   Last Name                         Address
0       MARC      OUTLAW      1 Valle de Santiago Avenue
1       GINA  WILLIAMSON            1001 Miyakonojo Lane
2      TRACY        COLE           1002 Ahmadnagar Manor
3      JARED         ELY         1003 Qinhuangdao Street
4     TRACEY     BARRETT  1006 Santa Brbara dOeste Manor

In [22]:
yem("select first_name,last_name,address from customer c, address a where c.address_id=a.address_id").head()

  first_name last_name            address
0       MARY     SMITH     1913 Hanoi Way
1   PATRICIA   JOHNSON   1121 Loja Avenue
2      LINDA  WILLIAMS  692 Joliet Street
3    BARBARA     JONES   1566 Inegl Manor
4  ELIZABETH     BROWN    53 Idfu Parkway

In [23]:
yem("select * from address").head(3)

,address_id,address,address2,district,city_id,postal_code,phone,last_update
0,1,47 MySakila Drive,None,,300,None,,2011-09-14 18:05:16
1,2,28 MySQL Boulevard,None,,576,None,,2011-09-14 18:05:16
2,3,23 Workhaven Lane,None,,300,None,,2011-09-14 18:05:16

In [24]:
yem("select address_id from store where store_id=1")

   address_id
0           1

In [25]:
yem("select * from store").head(3)

   store_id  manager_staff_id  address_id          last_update
0         1                 1           1  2011-09-14 18:05:32
1         2                 2           2  2011-09-14 18:05:32

In [26]:
yem("select first_name from customer where first_name like'A%'").head()

  first_name
0     ANGELA
1        AMY
2       ANNA
3     AMANDA
4        ANN

In [27]:
yem("Select s.store_id [store number], a.address from store s, address a where s.address_id=a.address_id")

   store number             address
0             1   47 MySakila Drive
1             2  28 MySQL Boulevard

In [28]:
yem("select * from staff").head(2)

,staff_id,first_name,last_name,address_id,picture,email,store_id,active,username,password,last_update
0,1,Mike,Hillyer,3,None,Mike.Hillyer@sakilastaff.com,1,1,Mike,8cb2237d0679ca88db6464eac60da96345513964,2011-09-14 18:05:32
1,2,Jon,Stephens,4,None,Jon.Stephens@sakilastaff.com,2,1,Jon,8cb2237d0679ca88db6464eac60da96345513964,2011-09-14 18:05:32